
export interface Test {
    id: string;
    name: string;
    description: string;
    created_date: string;
    modified_date: string;
}

export interface TestResult {
    id: string;
    test: Test;
    is_finished: boolean;
    question_results: Array<{
        id: string;
        question: Question;
        answer: Answer;
        created_date: string;
        modified_date: string;
    }>;
    test_stat_results: TestStatResult[];
}

export interface Question {
    id: string;
    name: string;
    description: string;
    created_date: string;
    modified_date: string;
}

export type Answer = Question;

export interface TestStatResult {
    id: string;
    test_stat: {
        id: string;
        name: string;
        description: string;
        created_date: string;
        modified_date: string;
    };
    points: number;
    created_date: string;
    modified_date: string;
}

export interface TestListedResult {
    id: string;
    test: Test;
    is_finished: boolean;
    created_date: string;
    modified_date: string;
}

export interface AskedQuestion {
    id: string;
    name: string;
    description: string;
    created_date: string;
    modified_date: string;
    answers: Answer[];
}

export interface RegisterData {
    username: string;
    password: string;
    email: string;
}

export interface RegisterResponce {
    id: string;
    email: string;
    username: string;
}

export interface LoginResponce {
    id: string;
    email: string;
    token: string;
    username: string;
}

export const MOCK_TEST: Test = {
    "id": 'ASDASDASDSA',
    "name": "Опросник личностных адаптаций Джойнса",
    "description": "Президент Института групповой и семейной терапии Юго-Востока, доктор философии Ванн Джоинс, разработал Анкету адаптации личности Лайнса (JPAQ), в которой определены шесть адаптаций личности: Ответственный работоголик, Блестящий скептик, Игривый сопротивленец, Очаровывающий манипулятор, Творческий мечтатель.",
    "created_date": "2020-05-17T18:00:00Z",
    "modified_date": "2020-05-17T18:00:00Z"
};

export const MOCK_LISTED_RESULT = {
    "id": 'asdasd',
    "test": {
        "id": 'asdw43123',
        "name": "Опросник личностных адаптаций Джойнса",
        "description": "Президент Института групповой и семейной терапии Юго-Востока, доктор философии Ванн Джоинс, разработал Анкету адаптации личности Лайнса (JPAQ), в которой определены шесть адаптаций личности: Ответственный работоголик, Блестящий скептик, Игривый сопротивленец, Очаровывающий манипулятор, Творческий мечтатель.",
        "created_date": "2020-05-17T18:00:00Z",
        "modified_date": "2020-05-17T18:00:00Z"
    },
    "is_finished": false,
    "created_date": "2020-05-22T17:58:32.983023Z",
    "modified_date": "2020-05-22T17:58:32.983065Z"
};

export const MOCK_ASKED_QUESTION = {
    "id": '123123',
    "name": "Я думаю, что большинство людей беспечны в том, чем они занимаются.",
    "description": "",
    "answers": [
        {
            "id": 'asdasd',
            "name": "Правда",
            "description": "",
            "created_date": "2020-05-17T18:00:00Z",
            "modified_date": "2020-05-17T18:00:00Z"
        },
        {
            "id": 'asdasd',
            "name": "Ложь",
            "description": "",
            "created_date": "2020-05-17T18:00:00Z",
            "modified_date": "2020-05-17T18:00:00Z"
        }
    ],
    "created_date": "2020-05-17T18:00:00Z",
    "modified_date": "2020-05-17T18:00:00Z"
};

export const MOCK_RESULT: TestResult = {
    "id": 'afirij45',
    "test": {
        "id": '4545234asd',
        "name": "Опросник личностных адаптаций Джойнса",
        "description": "Президент Института групповой и семейной терапии Юго-Востока, доктор философии Ванн Джоинс, разработал Анкету адаптации личности Лайнса (JPAQ), в которой определены шесть адаптаций личности: Ответственный работоголик, Блестящий скептик, Игривый сопротивленец, Очаровывающий манипулятор, Творческий мечтатель.",
        "created_date": "2020-05-17T18:00:00Z",
        "modified_date": "2020-05-17T18:00:00Z"
    },
    "is_finished": false,
    "question_results": [
        {
            "id": '123233',
            "question": {
                "id": '123545',
                "name": "Я думаю, что большинство людей беспечны в том, чем они занимаются.",
                "description": "",
                "created_date": "2020-05-17T18:00:00Z",
                "modified_date": "2020-05-17T18:00:00Z"
            },
            "answer": {
                "id": '123123545',
                "name": "Правда",
                "description": "",
                "created_date": "2020-05-17T18:00:00Z",
                "modified_date": "2020-05-17T18:00:00Z"
            },
            "created_date": "2020-05-22T18:04:50.844264Z",
            "modified_date": "2020-05-22T18:04:50.844316Z"
        }
    ],
    "test_stat_results": [
        {
            "id": 'asdasdsad',
            "test_stat": {
                "id": 'hgfghtyry',
                "name": "Ответственный работоголик",
                "description": "(научное название адаптации для одобрения – навязчиво-принудительная)\nОриентированы на работу, надежные, пунктуальные, аккуратные, сотрудничающие. Они удивительно продуктивны и целеустремленны. Отлично работают в коллективе и превосходно проявляют себя на любой ответственной должности с большим объемом работы.\n\nРеагируют на стресс напряженностью, навязчивостями, чрезмерной сосредоточенностью, перфекционизмом, запредельной ответственностью. Они просто не знают, когда нужно остановиться. Им очень трудно делегировать полномочия и передавать ответственность. Часто их девизы: «Если ты хочешь, чтобы что-то было сделано, сделай это сам» и «Если это нужно сделать, это нужно сделать хорошо».\n\nОни изнуряют себя, стараясь всё сделать. Часто единственный способ сделать перерыв и не чувствовать себя виноватым – это заболеть.\n\nОтветственные работоманы рано в своей жизни, обычно к 5 или 6 годам, понимают, что больше всего похвалы они получают за деятельность и достижения, а не за то, что они просто есть. В семье происхождения чувствам уделялось очень ограниченное внимание. Соответственно, они больше стремятся работать и думать, чем чувствовать.\n\nОтветственные работоманы – образцовые граждане и члены общества. Они постоянно занимаются полезной деятельностью, а на отдыхе всего лишь выполняют меньше задач. Они думают, планируют и делают. Часто они используют списки дел, чтобы организовать свои обязанности. Нередко они теряют какое бы то ни было чувство баланса между работой и отдыхом. Они много работают в ущерб своему здоровью, что может привести к серьезным недомоганиям.\n\nОтветственным работоманам нужно понять, что они не обязаны быть совершенными, они могут делать ошибки и при этом продолжать быть успешными в жизни, и другие все равно захотят быть с ними рядом. Делать или быть – их основная дилемма. Очень важно понять, что они могут позволять себе отдыхать, а не уработаться насмерть. Им нужно успокаивать свою внутреннюю тревогу и обучиться прекрасному искусству просто быть.\n\nОтветственным работоманам нужно, чтобы другие обращались к ним через мышление, а затем помогали им думать более глубоко за счет контакта со своими чувствами. Очень помогает, когда другие разрешают им и вдохновляют их делать перерывы в работе, расслабляться и получать удовольствие от жизни с помощью игривой ипостаси их личности.\n\nОтветственные работоманы лучше всего продвигаются в жизни, если они интегрируют чувства и мышление, позволяют себе некоторый процент ошибок, учатся отдыхать и ценить себя просто за свое существование, а не только за достижения. Тогда Вы увидите большие изменения в их поведении.",
                "created_date": "2020-05-17T18:00:00Z",
                "modified_date": "2020-05-17T18:00:00Z"
            },
            "points": 0,
            "created_date": "2020-05-22T17:58:33.001355Z",
            "modified_date": "2020-05-22T17:58:33.001410Z"
        },
        {
            "id": '432424',
            "test_stat": {
                "id": 'asduinin',
                "name": "Ответственный работоголик",
                "description": "(научное название адаптации для одобрения – навязчиво-принудительная)\nОриентированы на работу, надежные, пунктуальные, аккуратные, сотрудничающие. Они удивительно продуктивны и целеустремленны. Отлично работают в коллективе и превосходно проявляют себя на любой ответственной должности с большим объемом работы.\n\nРеагируют на стресс напряженностью, навязчивостями, чрезмерной сосредоточенностью, перфекционизмом, запредельной ответственностью. Они просто не знают, когда нужно остановиться. Им очень трудно делегировать полномочия и передавать ответственность. Часто их девизы: «Если ты хочешь, чтобы что-то было сделано, сделай это сам» и «Если это нужно сделать, это нужно сделать хорошо».\n\nОни изнуряют себя, стараясь всё сделать. Часто единственный способ сделать перерыв и не чувствовать себя виноватым – это заболеть.\n\nОтветственные работоманы рано в своей жизни, обычно к 5 или 6 годам, понимают, что больше всего похвалы они получают за деятельность и достижения, а не за то, что они просто есть. В семье происхождения чувствам уделялось очень ограниченное внимание. Соответственно, они больше стремятся работать и думать, чем чувствовать.\n\nОтветственные работоманы – образцовые граждане и члены общества. Они постоянно занимаются полезной деятельностью, а на отдыхе всего лишь выполняют меньше задач. Они думают, планируют и делают. Часто они используют списки дел, чтобы организовать свои обязанности. Нередко они теряют какое бы то ни было чувство баланса между работой и отдыхом. Они много работают в ущерб своему здоровью, что может привести к серьезным недомоганиям.\n\nОтветственным работоманам нужно понять, что они не обязаны быть совершенными, они могут делать ошибки и при этом продолжать быть успешными в жизни, и другие все равно захотят быть с ними рядом. Делать или быть – их основная дилемма. Очень важно понять, что они могут позволять себе отдыхать, а не уработаться насмерть. Им нужно успокаивать свою внутреннюю тревогу и обучиться прекрасному искусству просто быть.\n\nОтветственным работоманам нужно, чтобы другие обращались к ним через мышление, а затем помогали им думать более глубоко за счет контакта со своими чувствами. Очень помогает, когда другие разрешают им и вдохновляют их делать перерывы в работе, расслабляться и получать удовольствие от жизни с помощью игривой ипостаси их личности.\n\nОтветственные работоманы лучше всего продвигаются в жизни, если они интегрируют чувства и мышление, позволяют себе некоторый процент ошибок, учатся отдыхать и ценить себя просто за свое существование, а не только за достижения. Тогда Вы увидите большие изменения в их поведении.",
                "created_date": "2020-05-17T18:00:00Z",
                "modified_date": "2020-05-17T18:00:00Z"
            },
            "points": 0,
            "created_date": "2020-05-22T17:58:33.001355Z",
            "modified_date": "2020-05-22T17:58:33.001410Z"
        },
        {
            "id": 'asdasdw443',
            "test_stat": {
                "id": 'asd34324',
                "name": "Ответственный работоголик",
                "description": "(научное название адаптации для одобрения – навязчиво-принудительная)\nОриентированы на работу, надежные, пунктуальные, аккуратные, сотрудничающие. Они удивительно продуктивны и целеустремленны. Отлично работают в коллективе и превосходно проявляют себя на любой ответственной должности с большим объемом работы.\n\nРеагируют на стресс напряженностью, навязчивостями, чрезмерной сосредоточенностью, перфекционизмом, запредельной ответственностью. Они просто не знают, когда нужно остановиться. Им очень трудно делегировать полномочия и передавать ответственность. Часто их девизы: «Если ты хочешь, чтобы что-то было сделано, сделай это сам» и «Если это нужно сделать, это нужно сделать хорошо».\n\nОни изнуряют себя, стараясь всё сделать. Часто единственный способ сделать перерыв и не чувствовать себя виноватым – это заболеть.\n\nОтветственные работоманы рано в своей жизни, обычно к 5 или 6 годам, понимают, что больше всего похвалы они получают за деятельность и достижения, а не за то, что они просто есть. В семье происхождения чувствам уделялось очень ограниченное внимание. Соответственно, они больше стремятся работать и думать, чем чувствовать.\n\nОтветственные работоманы – образцовые граждане и члены общества. Они постоянно занимаются полезной деятельностью, а на отдыхе всего лишь выполняют меньше задач. Они думают, планируют и делают. Часто они используют списки дел, чтобы организовать свои обязанности. Нередко они теряют какое бы то ни было чувство баланса между работой и отдыхом. Они много работают в ущерб своему здоровью, что может привести к серьезным недомоганиям.\n\nОтветственным работоманам нужно понять, что они не обязаны быть совершенными, они могут делать ошибки и при этом продолжать быть успешными в жизни, и другие все равно захотят быть с ними рядом. Делать или быть – их основная дилемма. Очень важно понять, что они могут позволять себе отдыхать, а не уработаться насмерть. Им нужно успокаивать свою внутреннюю тревогу и обучиться прекрасному искусству просто быть.\n\nОтветственным работоманам нужно, чтобы другие обращались к ним через мышление, а затем помогали им думать более глубоко за счет контакта со своими чувствами. Очень помогает, когда другие разрешают им и вдохновляют их делать перерывы в работе, расслабляться и получать удовольствие от жизни с помощью игривой ипостаси их личности.\n\nОтветственные работоманы лучше всего продвигаются в жизни, если они интегрируют чувства и мышление, позволяют себе некоторый процент ошибок, учатся отдыхать и ценить себя просто за свое существование, а не только за достижения. Тогда Вы увидите большие изменения в их поведении.",
                "created_date": "2020-05-17T18:00:00Z",
                "modified_date": "2020-05-17T18:00:00Z"
            },
            "points": 0,
            "created_date": "2020-05-22T17:58:33.001355Z",
            "modified_date": "2020-05-22T17:58:33.001410Z"
        }
    ]
};
